<%@ page language="java" contentType="text/html; charset=ISO-8859-1"
    pageEncoding="ISO-8859-1"%>
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Заказ | Ladyka Andrei</title>
</head>
<body>
<h1>Заказ.</h1><br>
<h3>В БД хранится информация о заказах магазина и товарах в них.</h3>
<h4>Для заказа необходимо хранить:</h4>
	<ul>
	<li>– номер заказа;</li>
	<li>– товары в заказе;</li>
	<li>– дату поступления.</li>
	</ul>
<h4>Для товаров в заказе необходимо хранить:</h4>
	– товар;
	– количество.
Для товара необходимо хранить:
	– название;
	– описание;
	– цену.
•	Вывести полную информацию о заданном заказе.
•	Вывести номера заказов, сумма которых не превосходит заданную, 
и количество различных товаров равно заданному.
•	Вывести номера заказов, содержащих заданный товар.
•	Вывести номера заказов, не содержащих заданный товар и поступивших в течение текущего дня.
•	Сформировать новый заказ, состоящий из товаров, заказанных в текущий день.
•	Удалить все заказы, в которых присутствует заданное количество заданного товара.

</body>
</html>